{
  "Entries": [
    {
      "VersionCode": 2010454,
      "Title": "Changes in version 2.1.4",
      "Messages": [
        "Fix crash when stopping collector service if not fully initialized.",
        "Fix crash when no active SIM cards on collector start.",
        "Show warning when GPS not available while starting collecting through intent.",
        "Enforce secure connections."
      ]
    },
    {
      "VersionCode": 2010352,
      "Title": "Changes in version 2.1.3",
      "Messages": [
        "Fix only measurements from first SIM card collected on Android 10. Thanks Kami!",
        "Fix crash on Samsung Galaxy A6.",
        "Updated Chinese, Hungarian, Italian and Spanish translations."
      ]
    },
    {
      "VersionCode": 2010250,
      "Title": "Changes in version 2.1.2",
      "Messages": [
        "Fix duplicated logs when file logging enabled."
      ]
    },
    {
      "VersionCode": 2010149,
      "Title": "Changes in version 2.1.1",
      "Description": "This version brings many fixes and improvements mainly for Android 10.",
      "Messages": [
        "Fix export and logging not working on Android 10 due to scoped storage feature.",
        "Fix cell info not refreshed on Android 10.",
        "Fix 5G (NR) and TD-SCDMA network type field not handled properly in upload and export.",
        "Add support for background location permission on Android 10.",
        "Remove code for not supported Android versions."
      ]
    },
    {
      "VersionCode": 2010044,
      "Title": "Changes in version 2.1.0",
      "Description": "Newly added support for 5G (NR) and TD-SCDMA currently allows you to collect an export data to CSV and GPX formats. It's not possible to upload such measurements because OpenCellId and Mozilla Location Services don't accept them yet. Because 5G is not available in my country and TD-SCDMA is used only in China I'm not able to test them with real data, so if you find any issues related to collecting, export or upload please contact me!",
      "Messages": [
        "Dropped support for Android 4.0-4.4.",
        "Add support for 5G (NR) and TD-SCDMA on Android 10+."
      ]
    }
  ]
}