{
  "Entries": [
    {
      "VersionCode": 2080081,
      "Description": "This version introduces new way of interacting with file system and reduces number of requested permissions. The change is required to make the application running correctly on Android 11. I'm open to any feedback, feel free to contact me by email, Twitter, Facebook or GitHub - links in Preferences :)",
      "Title": "Changes in version 2.8.0",
      "Messages": [
        "Fix export and import of files on Android 11 with help of document picker.",
        "Improve compatibility with Android 11.",
        "Improve default map location when no measurements locally.",
        "Fix cannot open notification settings from Display Preferences.",
        "Fix crash when trying to open app permission settings.",
        "Update OpenCellID registration link.",
        "Updated privacy statement with one missing feature.",
        "Update translations."
      ]
    },
    {
      "VersionCode": 2070476,
      "Title": "Changes in version 2.7.4",
      "Messages": [
        "Fix RSRP value too high on Samsung phones.",
        "Fix map not refreshed after upload.",
        "Fix log file not recreated after deletion until app gets killed.",
        "Fix Ukrainian translation.",
        "Small improvements."
      ]
    },
    {
      "VersionCode": 2070374,
      "Title": "Changes in version 2.7.3",
      "Messages": [
        "Improve privacy statement according to updated Google Play policy.",
        "Add scale bar to the map.",
        "Add short CID and RNC to map maker description."
      ]
    },
    {
      "VersionCode": 2070273,
      "Title": "Changes in version 2.7.2",
      "Messages": [
        "Add copyright notice for OpenStreetMap.org to the map tab."
      ]
    },
    {
      "VersionCode": 2070172,
      "Title": "Changes in version 2.7.1",
      "Messages": [
        "Try to fix crash when map configuration was not fully initialized."
      ]
    },
    {
      "VersionCode": 2070071,
      "Title": "Changes in version 2.7.0",
      "Description": "This version introduces the new tab containing the map that presents measurements stored on your device. I'm open to any feedback, feel free to contact me by email, Twitter, Facebook or GitHub - links in Preferences :)",
      "Messages": [
        "Add new map tab presenting locally stored measurements.",
        "Add short CID and RNC to CSV export and JSON notifications.",
        "Add support for new OpenCellID access token (formerly API key) format.",
        "Add Turkish translation. Thanks to Gökdeniz Küçükali :)",
        "Update translations."
      ]
    }
  ]
}