{
  "Entries": [
    {
      "VersionCode": 1220027,
      "Title": "Changes in version 1.22.0",
      "Description": "Do you want to see the app in your language? Help me with <a href=\"http://i18n.zamojski.info/\">translations</a>! some languages are partially done but require volunteers - apply on the website or send me an email to start.",
      "Messages": [
        "Add option to stop collector when battery is getting low.",
        "Add collecting measurements when at least one of main cell changes even without move.",
        "Remove option to hide Collector notification on Oreo and newer because Android automatically increases channel importance to DEFAULT level for foreground services. <a href=\"https://zamojski.info/FAQ,Tower-Collector.html#OreoNotificationSound\">See more</a>.",
        "Fix exception when logging to file.",
        "Improve compatibility with Android P.",
        "Updated translations and new language - Ukrainian."
      ]
    },
    {
      "VersionCode": 1210026,
      "Title": "Changes in version 1.21.0",
      "Description": "Do you want to see the app in your language? Help me with <a href=\"http://i18n.zamojski.info/\">translations</a>! Catalan, Dutch, French, Hungarian, Spanish, Swedish are partially done but require volunteers - apply on the website or send me an email to start.",
      "Messages": [
        "Fix export to MLS JSON creating invalid files.",
        "Fix runtime permissions not checked before import and export of database or preferences.",
        "Add PSC value to exported GPX file.",
        "Improve network exception handling."
      ]
    },
    {
      "VersionCode": 1200024,
      "Title": "Changes in version 1.20.0",
      "Description": "Tower Collector is now available in <a href=\"https://f-droid.org/packages/info.zamojski.soft.towercollector/\">official F-Droid repository</a>! Special thanks to takiainen, est31 and IzzySoft for help :)",
      "Messages": [
        "Fix wrong order of labels for Export dialog for Portuguese and Russian languages.",
        "Fix invalid API key recognized as connection error during upload.",
        "Improve code compatibility with F-Droid repository rules.",
        "Add option to import/export internal preferences and database (use on your own risk!)."
      ]
    },
    {
      "VersionCode": 1190023,
      "Title": "Changes in version 1.19.0",
      "Description": "Do you want to see the app in your language? Help me with <a href=\"http://i18n.zamojski.info/\">translations</a>! Catalan, Dutch, French, Hungarian, Spanish are partially done but require volunteers - apply on the website or send me an email to start.",
      "Messages": [
        "Added Portuguese translation. Thank you for all the effort :)",
        "Created special version of Tower Collector for F-Droid open source repository. I still need some help to make the build running, please <a href=\"https://github.com/zamojski/TowerCollector/issues/25\">help me</a>."
      ]
    },
    {
      "VersionCode": 1180022,
      "Title": "Changes in version 1.18.0",
      "Description": "Do you want to see the app in your language? Help me with <a href=\"http://i18n.zamojski.info/\">translations</a>! Dutch, French, Hungarian, Portuguese, Spanish are partially done but require volunteers - apply on the website or send me an email to start.",
      "Messages": [
        "Added German, Polish and Russian translations. Thank you for all the effort :)",
        "Improved signal strength calculation for API 1 on Huawei devices."
      ]
    }
  ]
}