{
  "Entries": [
    {
      "VersionCode": 1100009,
      "Title": "Changes in version 1.10.0",
      "Messages": [
        "Introducing support for granting Android permissions at runtime.",
        "Improved display of 'restart needed' message in Preferences."
      ]
    },
    {
      "VersionCode": 1090308,
      "Title": "Changes in version 1.9.3",
      "Messages": [
        "Fixed 'GPS status' and 'incorrect system time' information not updated correctly."
      ]
    },
    {
      "VersionCode": 1090207,
      "Title": "Changes in version 1.9.2",
      "Messages": [
        "Fixed crash when stopping Collector on some devices.",
        "Fixed network type settings not opened on Android Ice Cream Sandwich.",
        "Hidden 'Network type' menu item if system is unable to open it.",
        "Improved error handling."
      ]
    },
    {
      "VersionCode": 1090106,
      "Title": "Changes in version 1.9.1",
      "Messages": [
        "Fixed crash when starting Collector on some devices.",
        "Fixed forced Collector API version 1 not applied correctly."
      ]
    },
    {
      "VersionCode": 1090005,
      "Title": "Changes in version 1.9.0",
      "Messages": [
        "Added option to notify other apps about new measurements collected. See more in Collector Preferences.",
        "Added option log execution details to file for problem investigation purposes.",
        "Added shortcut to change network type from menu.",
        "Fixed crash when stopping Collector in some rare cases.",
        "Changed unknown GPS status to initializing."
      ]
    },
    {
      "VersionCode": 1080002,
      "Title": "Changes in version 1.8.0",
      "Description": "Starting from this version Tower Collector will be available only in English. I made this decision to accelerate development of new features by reducing waiting for translation time to minimum. In the future I will add a glossary and more detailed introduction for novice users in their native language. I'd like to thank all of you who were engaged in app translation over the years and dedicated their own time to Tower Collector. I really appreciate that, thanks!",
      "Messages": [
        "Introducing basic Material Design style.",
        "Added option to start collecting on device boot.",
        "Changed Preferences to display descriptions in more friendly way.",
        "Improved contact option in Preferences."
      ]
    },
    {
      "VersionCode": 51,
      "Title": "Changes in version 1.7.6",
      "Description": "Join <a href=\"https://plus.google.com/communities/105724371687131986494\">Google+ Community</a> and try out the new beta version! I'm awaiting you feedback :)",
      "Messages": [
        "Fixed inconsistent GPS status shown in notification and on the bar shortly after Collector start.",
        "Fixed crash when web browser is not installed on a device."
      ]
    },
    {
      "VersionCode": 50,
      "Title": "Changes in version 1.7.5",
      "Description": "Tower Collector became open source - more on <a href=\"https://plus.google.com/communities/105724371687131986494\">Google+</a> :)",
      "Messages": [
        "Improved performance of the app and reduced battery usage when Collector is running.",
        "Fixed crash when web browser is not installed on a device.",
        "Improved notification layout for displaying long text."
      ]
    },
    {
      "VersionCode": 49,
      "Title": "Changes in version 1.7.4",
      "Description": "<a href=\"https://plus.google.com/communities/105724371687131986494\"><b><big>Official Google+ community</big></b></a>",
      "Messages": [
        "Fixed wrong description color and content in Collector and Advanced preferences."
      ]
    }
  ]
}