{
  "Entries": [
    {
      "VersionCode": 2110094,
      "Title": "Changes in version 2.11.0",
      "Messages": [
        "Fix number of discovered local cells higher than number of local cells.",
        "Fix upload configuration not saved when don't show again is checked.",
        "Fix export progress window sometimes stays open after export is finished.",
        "Fix export result window appears one more time after restoring minimized application.",
        "Fix crash when exporting data when storage folder is undefined.",
        "Add option to contribute anonymously on upload configurator.",
        "Improved descriptions and translations.",
        "Small bug fixes."
      ]
    },
    {
      "VersionCode": 2100093,
      "Title": "Changes in version 2.10.0",
      "Description": "This is brings the significantly changed Export function. Please report any issues or suggestions via email, link in the Preferences inside Help section.",
      "Messages": [
        "Add notification showing progress of Export operation.",
        "Add option to start and stop Export using Quick Settings toggles.",
        "Add option to start and stop Export using shortcuts.",
        "Add option to start and stop Export with Intents.",
        "Fix crash when starting other action while Export is in progress."
      ]
    },
    {
      "VersionCode": 2090389,
      "Title": "Changes in version 2.9.3",
      "Messages": [
        "Fix crash when displaying new version dialog in case the notification was created before application was updated.",
        "Always show location accuracy if available."
      ]
    },
    {
      "VersionCode": 2090288,
      "Title": "Changes in version 2.9.2",
      "Messages": [
        "Add unit of measure to map cache size preference.",
        "Change follow me icon on the map tab.",
        "Fix infinitely collecting data while stationary when on multi-SIM device one of reported main cells is invalid.",
        "Fix export of database and preferences not overwriting existing file.",
        "Fix export of database and preferences incorrectly overwriting existing file content.",
        "Fix export of preferences created file that couldn't be edited in text editor.",
        "Update translation."
      ]
    },
    {
      "VersionCode": 2090187,
      "Title": "Changes in version 2.9.1",
      "Messages": [
        "Fix crash when clicking on a link in a dialog window.",
        "Fix crash after database upgrade."
      ]
    }
  ]
}