{
  "Entries": [
    {
      "VersionCode": 2080385,
      "Title": "Changes in version 2.8.3",
      "Messages": [
        "Add option to disable listening for my location on the map.",
        "Add option to start collecting on app start-up.",
        "Add legend for the map.",
        "Fix collector crashing when there's no signal (Android bug).",
        "Fix animation to last measurement on the map if another animation is in progress."
      ]
    },
    {
      "VersionCode": 2080284,
      "Title": "Changes in version 2.8.2",
      "Messages": [
        "Fix crash when selecting a storage folder that cannot be used but can be selected.",
        "Fix displacement of position icon comparing to accuracy circle on the map.",
        "Fix swiping enabled on startup when the map was the last active tab.",
        "Disable listening for location when the map tab is created but not active.",
        "Add option to enable map updates only on wifi.",
        "Add option to postpone developer's message (this message) for later.",
        "Enlarge dot icons to make them easier to click.",
        "Hide tooltip on second click on dot."
      ]
    },
    {
      "VersionCode": 2080182,
      "Title": "Changes in version 2.8.1",
      "Description": "The 2.8.0 version introduced new way of interacting with file system and reduces number of requested permissions. The change is required to make the application running correctly on Android 11. I'm open to any feedback, feel free to contact me by email, Twitter, Facebook or GitHub - links in Preferences :)",
      "Messages": [
        "Add option to contribute to OpenCellID anonymously.",
        "Block navigation between tabs with swiping when map tab is active.",
        "Allow setting maximum map cache size.",
        "Disable clearing map cache when disabling map tab.",
        "Improve error handling."
      ]
    },
    {
      "VersionCode": 2080081,
      "Description": "This version introduces new way of interacting with file system and reduces number of requested permissions. The change is required to make the application running correctly on Android 11. I'm open to any feedback, feel free to contact me by email, Twitter, Facebook or GitHub - links in Preferences :)",
      "Title": "Changes in version 2.8.0",
      "Messages": [
        "Fix export and import of files on Android 11 with help of document picker.",
        "Improve compatibility with Android 11.",
        "Improve default map location when no measurements locally.",
        "Fix cannot open notification settings from Display Preferences.",
        "Fix crash when trying to open app permission settings.",
        "Update OpenCellID registration link.",
        "Updated privacy statement with one missing feature.",
        "Update translations."
      ]
    },
    {
      "VersionCode": 2070476,
      "Title": "Changes in version 2.7.4",
      "Messages": [
        "Fix RSRP value too high on Samsung phones.",
        "Fix map not refreshed after upload.",
        "Fix log file not recreated after deletion until app gets killed.",
        "Fix Ukrainian translation.",
        "Small improvements."
      ]
    },
    {
      "VersionCode": 2070374,
      "Title": "Changes in version 2.7.3",
      "Messages": [
        "Improve privacy statement according to updated Google Play policy.",
        "Add scale bar to the map.",
        "Add short CID and RNC to map maker description."
      ]
    }
  ]
}